/**
 * @NApiVersion 2.x
 * @NModuleScope Public
 */
define([], function(){
    
var DataRecordTypes = {};

DataRecordTypes.customformData = {
  	"北海道": '700',
	"青森県": '701',
	"岩手県": '702',
	"宮城県": '703',
	"秋田県": '704',
	"山形県": '705',
	"福島県": '706',
	"茨城県": '707',
	"栃木県": '708',
	"群馬県": '709',
	"埼玉県": '710',
	"千葉県": '711',
	"東京都": '712',
	"神奈川県": '713',
	"新潟県": '714',
	"富山県": '715',
	"石川県": '716',
	"福井県": '717',
	"山梨県": '718',
	"長野県": '719',
	"岐阜県": '720',
	"静岡県": '721',
	"愛知県": '722',
	"三重県": '723',
	"滋賀県": '724',
	"京都府": '725',
	"大阪府": '726',
	"兵庫県": '727',
	"奈良県": '728',
	"和歌山県": '729',
	"鳥取県": '730',
	"島根県": '731',
	"岡山県": '732',
	"広島県": '733',
	"山口県": '734',
	"徳島県": '735',
	"香川県": '736',
	"愛媛県": '737',
	"高知県": '738',
	"福岡県": '739',
	"佐賀県": '740',
	"長崎県": '741',
	"熊本県": '742',
	"大分県": '743',
	"宮崎県": '744',
	"鹿児島県": '745',
	"沖縄県": '746',
     'type_19': '19', //DJ_汎用区分.支払方法
     'type_33': '33', //DJ_汎用区分.出荷案内送信区分
     'type_34': '34', //DJ_汎用区分.出荷案内送付先区分
     'type_35': '35', //DJ_汎用区分.部分欠品区分
};

return {
    DataRecordTypes:DataRecordTypes,
};
});